chevaucheursDeVers/app/Models/Menu.php

select `menu_libelle`, `route`, `no_ordre` from `menu` where `pour_admin` in (0, 1) order by `no_ordre` asc
---
    public static function getMenu($isAdmin, $isConnected){
        $menuAppli = self::select('menu_libelle', 'route', 'no_ordre')
                        ->whereIn('pour_admin', [0, $isAdmin])
                        ->orderBy('no_ordre')
                        ->get();

select `menu_libelle` from `menu` where `route` in ('/historique') limit 1
---
    public static function getCurrentPage($url){
        $uri = parse_url($url, PHP_URL_PATH);
        $currentPage = self::whereIn('route', [$uri])
                            ->value('menu_libelle');