chevaucheursDeVers/app/Models/User.php

    public static function isAdministrateur($user){
        $isAdmin = self::where('pseudo', $user)
                        ->value('est_administrateur');
---
select `est_administrateur` from `users` where `pseudo` = 'Riri' limit 1