chevaucheursDeVers/app/Models/Utilisateurs.php

select `est_administrateur` from `utilisateurs` where `pseudo` = 'Riri' limit 1
---
    public static function isAdministrateur($user){
        $isAdmin = self::where('pseudo', $user)
                        ->value('est_administrateur');